app/views/clubs/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "user_clubs" ON "users"."id" = "user_clubs"."user_id" WHERE "user_clubs"."club_id" = ?  [["club_id", 15]]
---
<div class="row p-4">
      <% @club.users.each do |user| %>

SELECT "user_clubs".* FROM "user_clubs" WHERE "user_clubs"."user_id" = ? AND "user_clubs"."club_id" = ? LIMIT ?  [["user_id", 4], ["club_id", 30], ["LIMIT", 1]]
---
<% flash[:club_num] = @club.id %>
<% if !!UserClub.find_by(user_id: @current_user.id, club_id: @club.id)%>

SELECT "club_episodes".* FROM "club_episodes" WHERE "club_episodes"."club_id" = ?  [["club_id", 1]]
SELECT "episodes".* FROM "episodes" INNER JOIN "club_episodes" ON "episodes"."id" = "club_episodes"."episode_id" WHERE "club_episodes"."club_id" = ?  [["club_id", 24]]
---
<div class= "text-center m-5">
<% @club.episodes.each do |episode| %>

SELECT "user_clubs".* FROM "user_clubs" WHERE "user_clubs"."user_id" = ? AND "user_clubs"."club_id" = ? LIMIT ?  [["user_id", 4], ["club_id", 24], ["LIMIT", 1]]
---

<%= button_to "Leave Club",  user_club_path(UserClub.find_by(user_id: @current_user.id, club_id: @club.id)), method: :delete, data: {confirm: "Are you sure you want to leave this club?"}, class: "btn btn-dark" %>