app/views/users/homepage.html.erb

  <div class="carousel-inner w-80 h-80 mb-5">
  <% Club.all.sample(1).each do |club| %>
---
SELECT "clubs".* FROM "clubs"


  <% Club.all.sample(2).each do |club| %>
---
SELECT "clubs".* FROM "clubs"