app/views/users/show.html.erb

<div class="row">
   <% @user.clubs.each do |club| %>
---
SELECT "clubs".* FROM "clubs" INNER JOIN "user_clubs" ON "clubs"."id" = "user_clubs"."club_id" WHERE "user_clubs"."user_id" = ?  [["user_id", 4]]