app/controllers/club_episodes_controller.rb

SELECT "club_episodes".* FROM "club_episodes" ORDER BY "club_episodes"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def index
        @club_episodes = ClubEpisode.all

INSERT INTO "club_episodes" ("club_id", "episode_id", "month", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["club_id", 2], ["episode_id", 1], ["month", "2020-09-01"], ["created_at", "2020-09-29 19:45:22.850605"], ["updated_at", "2020-09-29 19:45:22.850605"]]
---
    def create
        @club_episode = ClubEpisode.create(club_episode_params)