app/controllers/clubs_controller.rb

    def create
        @club = Club.create(club_params)
---
INSERT INTO "clubs" ("name", "genre", "club_image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def update
        @club.update(club_params)
---
UPDATE "clubs" SET "club_image" = ?, "updated_at" = ? WHERE "clubs"."id" = ?  [["club_image", "https://empowerms.org/wp-content/uploads/2019/10/images.jpeg"], ["updated_at", "2020-10-01 19:26:51.856777"], ["id", 15]]

    def find_club
        @club = Club.find(params[:id])
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]