app/controllers/comments_controller.rb

INSERT INTO "comments" ("text", "user_id", "created_at", "updated_at", "episode_id") VALUES (?, ?, ?, ?, ?)  [["text", "dlfikjno3kvwpon"], ["user_id", 1], ["created_at", "2020-09-30 18:32:40.968701"], ["updated_at", "2020-09-30 18:32:40.968701"], ["episode_id", 6]]
---
    def create
        @comment = @episode.comments.build(comment_params)
        @comment.user_id = @current_user.id
        if @comment.save

SELECT "club_episodes".* FROM "club_episodes" WHERE "club_episodes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "episodes".* FROM "episodes" INNER JOIN "comments" ON "episodes"."id" = "comments"."episode_id" WHERE "comments"."user_id" = ? AND "episodes"."id" = ? LIMIT ?  [["user_id", 1], ["id", 6], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ? AND "comments"."id" = ? LIMIT ?  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
SELECT "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]
---
    def destroy
        @user = @current_user
        @episode = @user.episodes.find(params[:episode_id])
        @comment = @user.comments.find(params[:id])
        @comment.destroy

SELECT "club_episodes".* FROM "club_episodes" WHERE "club_episodes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def load_episode
        @episode = Episode.find(params[:episode_id])