app/controllers/episodes_controller.rb

DELETE FROM "episodes" WHERE "episodes"."id" = ?  [["id", 157]]
---
    def destroy
        @episode.destroy

SELECT "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT ?  [["id", 62], ["LIMIT", 1]]
---
    def find_episode
        @episode = Episode.find(params[:id])