app/controllers/users_controller.rb

INSERT INTO "users" ("username", "name", "age", "favorite_genre", "profile_pic", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @user = User.create(user_params)

UPDATE "users" SET "profile_pic" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_pic", "https://cdn.spacetelescope.org/archives/images/screen/opo9607a.jpg"], ["updated_at", "2020-10-02 14:56:22.881118"], ["id", 2]]
---
    def update
        @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "mrs161"], ["LIMIT", 1]]
---
    def handle_login
        @user = User.find_by(username: params[:username])