app/controllers/user_clubs_controller.rb

INSERT INTO "user_clubs" ("user_id", "club_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["club_id", 2], ["created_at", "2020-09-29 18:09:54.936259"], ["updated_at", "2020-09-29 18:09:54.936259"]]
---
    def create

        @user_club = UserClub.create(user_club_params)

DELETE FROM "user_clubs" WHERE "user_clubs"."id" = ?  [["id", 6]]
---
    def destroy
        @user_club.destroy

SELECT "user_clubs".* FROM "user_clubs" WHERE "user_clubs"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def find_user_club
        @user_club = UserClub.find(params[:id])