app/models/club.rb

SELECT "club_episodes".* FROM "club_episodes" WHERE "club_episodes"."club_id" = ?  [["club_id", 1]]
---
    def current_episode
        self.club_episodes.find{|club_episode| club_episode.month == Date.today.strftime("%Y-%m")}