app/views/club_episodes/new.html.erb

SELECT "episodes".* FROM "episodes"
---
  <%= f.label :episode_id  %>
  <%= f.collection_select :episode_id, Episode.all, :id, :full_name, {prompt: "Select an episode"}, {class: "form-control"}%>